{
    "Visualizations": [
        {
            "Visualization": "Global Bar Plot",
            "Connections": {
                "Beeswarm Plot": "To see the valence and distribution of each feature's SHAP values, select the Beeswarm Plot.",
                "Scatter Plots": "To see the distribution of SHAP values for a specific feature, click the Scatter Plots button."
            }
        },
        {
            "Visualization": "Beeswarm Plot",
            "Connections": {
                "Global Bar Plot": "To understand the overall importance of each feature, select the Global Bar Plot.",
                "Scatter Plots": "For a deeper dive into individual feature distributions, view the Scatter Plots."
            }
        },
        {
            "Visualization": "Scatter Plots",
            "Connections": {
                "Global Bar Plot": "For a broader view of feature importance, consider the Global Bar Plot.",
                "Beeswarm Plot": "For a comprehensive overview of SHAP value distributions across all features, go to the Beeswarm Plot."
            }
        },
        {
            "Visualization": "Local Bar Plot",
            "Connections": {
                "Waterfall Plot": "To see a detailed breakdown of how each feature contributes to a specific prediction, view the Waterfall Plot.",
                "Similar Data Table": "To compare this to similar data points with the same prediction, check out the Similar Data Table.",
                "Counterfactual Data Table": "To see similar data points that had the opposite prediction, select the Counterfactual Data Table."
            }
        },
        {
            "Visualization": "Waterfall Plot",
            "Connections": {
                "Local Bar Plot": "For a summarized view of feature impact on individual predictions, return to the Local Bar Plot.",
                "Similar Data Table": "Similar data points with the same prediction can be found on the Similar Data Table.",
                "Counterfactual Data Table": "To see similar data points with the opposite prediction, use the Counterfactual Data Table."
            }
        },
        {
            "Visualization": "Similar Data Table",
            "Connections": {
                "Counterfactual Data Table": "To see similar data points with the opposite prediction, use the Counterfactual Data Table.",
                "Waterfall Plot": "To see how different features contribute to this data point's prediction, use the Waterfall Plot.",
                "Local Bar Plot": "For a feature-focused view of this data point's prediction, switch to the Local Bar Plot."
            }
        },
        {
            "Visualization": "Counterfactual Data Table",
            "Connections": {
                "Similar Data Table": "To see similar data points with the same prediction, use the Similar Data Table.",
                "Waterfall Plot": "For a breakdown of feature impacts leading to this data point's prediction, view the Waterfall Plot.",
                "Local Bar Plot": "For a feature-focused view of this data point's prediction, switch to the Local Bar Plot."
            }
        }
    ],
    "Scope Switch": "Select Scope Switch to view / visualizations"
}